tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/Users/rtr/work/Cowboy-Test/tsung-1.6.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="info">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="5000" />
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="8080" type="tcp" />
    <!-- SSL: <server host="localhost" port="8443" type="ssl" /> -->
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="localhost" type="erlang" />
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
    <arrivalphase phase="1" duration="60" unit="second">
      <users maxnumber="40000" arrivalrate="1000" unit="second"/>
      <!-- SSL: <users maxnumber="12000" arrivalrate="400" unit="second"/> -->
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <for from="1" to="50" incr="1" var="i">
        <request>
          <http url="/foobar/%%_i%%" method="GET" version="1.1"/>
        </request>
      </for>
    </session>
 </sessions>

</tsung>