tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/Users/rtr/work/Cowboy-Test/tsung-1.6.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="info">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="5000" />
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="localhost" port="8080" type="tcp" />
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="localhost" type="erlang" />
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="30" unit="second">
     <users arrivalrate="200" unit="second" />
   </arrivalphase>
   <arrivalphase phase="2" duration="30" unit="second">
     <users arrivalrate="250" unit="second" />
   </arrivalphase>
   <arrivalphase phase="3" duration="30" unit="second">
     <users arrivalrate="300" unit="second" />
   </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="350" unit="second" />
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="400" unit="second" />
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="450" unit="second" />
   </arrivalphase>
  </load>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">
    <request> <http url="/foobar" method="GET" version="1.1" /> </request>
  </session>
 </sessions>
</tsung>